Revit 2027 API
StructuralAsset.ConcreteBendingReinforcement Property
 The bending reinforcement of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ConcreteBendingReinforcement { get; set; }
Public Property ConcreteBendingReinforcement As Double
	Get
	Set
public:
property double ConcreteBendingReinforcement {
	double get ();
	void set (double value);
}
member ConcreteBendingReinforcement : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be concrete to set this property.
Remarks
 Applies to concrete-based structural assets.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace